import pygame

# ініціалізація (запуск) пайгейму
# треба для роботи шрифтів та текстів
pygame.init()

# базовий клас спрайт
# підходить для багатьох ігор
# можна копіювати в інші проекти
# складається з хітбоксу та картинки
class Sprite():

    # конструктор спрайту
    # запускається під час створення нового спрайту
    # задає початкові властивості
    # розміри, координати, колір, швидкість
    def __init__(self, width, height, x, y, color, speed):
        
        # створюємо хітбокс
        # хітбокс - це прямокутник, тому використовуємо відповідний клас
        # задаємо розміри та координати прямокутника
        self.hitbox = pygame.Rect(x, y, width, height)

        # задаємо колір спрайт
        self.color = color
        # задаємо швидкість спрайту
        self.speed = speed