score = 0
def question(q, right_answer):
    global score
    u = input(q + " ")
    if u.lower() == right_answer.lower():
        print("Вірно!")
        score += 1
    else:
        print("Не Вірно!")
question("Столиця України? ", "Київ")
question("що сталося в 1939", "пльщу поділили")
question("Найшвидша тварина у світі? ", "Гепард")
question("коли срср розпався ", "26 грудня 1991 року")
question("хто президент україни ", "зеленський")
question("що сталося в хіросімі ", "скинули атомну бомбу")
question("коли з'явився будапештський меморандум", " в 1994 року")
question("що закінчилось в 20 ст", "19 ст")
question("в країні халепа і я кажу 'треба валити' ваша відповідь' ," "валити кого")
question("як називаєця річ яка відчиняє кімнату де зберігаюця гроші україни ", "набу")
question("де знаходиця найбільшапустеля європи", "олешківськи піски на україні")
print(score)