score = 0

def question(q, right_answer):
    global score
    u = input(q + " ")
    if u.lower() == right_answer.lower():
        print("Вірно!")
        score += 1
    else:
        print("Невірно!")

question("Столиця України?", "Київ")
question("Що сталося у 1939 році?", "Польщу поділили")
question("Найшвидша тварина у світі?", "Гепард")
question("Коли СРСР розпався?", "26 грудня 1991 року")
question("Хто президент України?", "Зеленський")
question("Що сталося в Хіросімі?", "Скинули атомну бомбу")
question("Коли з'явився Будапештський меморандум?", "1994 року")
question("Що закінчилось у 20 столітті?", "19 століття")
question("У країні халепа, і я кажу: «Треба валити». Ваша відповідь?", "Валити кого")
question("Як називається орган, який відкриває кімнату, де зберігаються гроші України?", "НАБУ")
question("Де знаходиться найбільша пустеля Європи?", "Олешківські піски в Україні")

print(score)
