from time import time

def question2(q, right_answer):
    while True:
        ans = input(q + " ")
        if ans.lower().strip() == right_answer.lower():
            print("Вірно!")
            break
        else:
            print("Невірно!")

start_time = time()

question2("Хто найрозумніша людина?", "Ейнштейн")
question2("З якою швидкістю бігла найшвидша людина?", "183 км/год")
question2("Найдорожча машина?", "Тесла")
question2("Хто президент України?", "Зеленський")
question2("Що відбувається 31 грудня?", "Новий рік")
question2("Скільки буде 2000 + 26?", "2026")
question2("Що таке колюче, високе, і на ньому ростуть шишки?", "Ялинка")
question2("Найпопулярніший ресторан в Україні?", "Макдональдс")
question2("Найпопулярніше місто в Україні?", "Київ")
question2("З якою швидкістю їхала найшвидша машина?", "490 км/год")
question2("Що найбільше бісить людей узимку?", "Лід")
question2("Що таке біле, схоже на моржа?", "Тюлень")
question2("Що дуже часто кладуть на стіл у Новий рік?", "олівʼє")
question2("Найскладніше питання: скільки шишок може вирости з однієї ялинки?", "1000")


end_time = time()
elapsed_time = round(end_time - start_time, 2)
print(elapsed_time)
