
def question2(q, right_answer):
    while True:
        ans = input(q)
        if  ans.lower() ==  right_answer.lower():
            print("Вірно!")
            break
        else:
            print("Не вірно!")


question2("хто сама умніша людина ", "Енштейн")
question2(" с якою швидкістю бішла сама швижка людина ", "183км")
question2("сама дорога машина  ", "тесла")
question2("хто призедент України", "Зеленський")
question2("сама крута пісня в Україні ", "Селуєти")
question2("скільки буде 2000 + 26 ", "2026")
question2("шо таке колюче високе ростуть шишки  ", "ялинка")
question2("самий популярний ресторан в Україні ", "Магдональз")
question2("саме попорялне місто в Україні ", "КИїв")
question2(" с якою швидкістю їхала сама швижка машина", "490км")
