import pandas as pd

# Завантажуємо датафрейм 
df = pd.read_csv('google_apps_sample\GoogleApps.csv')


# Як називається програма, розташована першим у наборі даних?
print(df.head(1))

# До якої категорії відноситься додаток, розташований останнім у наборі даних?
print(df.tail(1))

# Скільки стовпців міститься у наборі даних?
# Дані якого типу зберігаються у кожному зі стовпців?
print(df.info())

# Вкажіть середнє арифметичне та медіану розміру додатків (Size)
# Скільки коштує найдорожчий додаток?
# *Вкажіть середнє арифметичне та медіану кількості установок програм (Installs)
print(df.describe())