def question2(q, right_answer):
  user_answer = input(q).lower()
  while True:
      if user_answer == right_answer.lower():
          print("Вірно!")
          return
      else:
          print("Не вірно!")
          print(f"{right_answer}")
          user_answer = input(q).lower()
      

question2("Столиця України? ", "Київ")
question2("Найшвидша тварина у світі? ", "Гепард")
question2("Назва гімну України?", "Ще не вмерла України...")
question2("Набільши літак у світі? ", "Мрія")
question2("У якому році Україна проголосила незалежність? ", "1991")
question2("Найбільша тварина у світі? ", "Синій кіт")
question2("Яка рослина є найвищою у світі? ", "Секвоя")
question2("Який океан є найглибшим? ", "Тихий океан")
question2("Що стає мокрим, коли сушить інші речі? ", "Рушник")
question2("Що має багато ключів, але не може відкрити жодних дверей? ", "клавіатура")
question2("Що можна побачити із заплющеними очима? ", "Сон")
question2("Чим більше з неї береш - тим більше вона стає? ", "Яма")
question2("Що завжди попереду тебе, але ти ніколи не можеш його наздогнати? ", "Майбутнє")
question2("Що належить тобі, але інші використовують його частіше за тебе? ", "Ім'я")
question2("Як річ 'біжить', але ніг не має? ", "Час")
question2("ТЕПЕР ОСТАННЄ ПИТАННЯ!!!! ПРИГОТУЙСЯ... ЦЕЕЕЕЕ-      чомущо? ", "томукто")