print("                                            Вітаю тебе в вікторині!")
print("                                                    Успіхів!")

bals = 0

def question2(text, answer, answer2 = "", answer3 = ""):
    global bals
    b = input(text).lower().strip()
    if b == answer or (b == answer2 and answer2 != "") or (b == answer3 and answer3 != ""):
        print("Чудово!")
        bals += 1
    else:
        print("Не правильно!")
        
while True:
    f = input("Питання 1-ше. Ти людина чи робот: ").lower().strip()
    if f == "робот":
        question2("Скільки буде: 7 + 7 : 7 + 7 * 7 - 7: ", "50")
        question2("Скільки буде: 8 + 8 : 8 + 8 * 8 - 8: ", "65")
        question2('Скільки буде: 9 + 9 : 9 + 9 * 9 - 9: ', "82")
        question2("Скільки буде: 6 + 6 : 6 + 6 * 6 - 6: ", "37")
        if bals > 1:
            print("                                          Вітаю ти пройшов вікторину")
            print(f"                                        Ти заробив {bals}/4 балів")
        else:
            print(f"                            Мені шкода але ти програв тому що ти заробив {bals}/4 балів")
            print("                                             Ти поганий робот")
        break
    elif f == "людина":
        question2("Яка столиця України?", "київ", "столиця київ", "місто київ")
        question2("Яке найбільше озеро в Україні?", "світязь", "озеро світязь")
        question2("Яке свято 31 грудня?", "новий рік")
        question2("Перший колір веселки?", "червоний", "червоний колір")
        question2("Найбільший океан в світі", "тихий", "тихий океан")
        question2("Найбільша пустеля в світі", "сахара", "пустеля сахара")
        if bals > 1:
            print("                                          Вітаю ти пройшов вікторину")
            print(f"                                        Ти заробив {bals}/6 балів")
        else:
            print(f"                            Мені шкода але ти програв тому що ти заробив {bals}/6 балів")
        break
    else:
        print("Такого варіанту відповіді не існує!")
        