score = 0 
def question(q, right_answer):
    global score
    user_answer = input(q + " ").lower().strip()
    if user_answer == right_answer.lower():
        print("Вірно!\n")
        score += 1
    else:
        print(f"Невірно! Правильна відповідь: {right_answer}\n")

question("У яких роках «Реал Мадрид» був у своєму праймі?", "2016-2018")
question("Скільки «Золотих м'ячів» має Кріштіану Роналду?", "5")
question("Скільки Ліги чемпіонів виграв «Реал Мадрид»?", "15")
question("Скільки Ліги чемпіонів має «Барселона»?", "5")
question("Скільки голів Кріштіану Роналду забив за збірну Португалії (на 2024 рік)?", "128")
question("Хто є найкращим бомбардиром Ліги чемпіонів?", "крішітіану роналду")
question("У якому році Ліонель Мессі дебютував за основну команду «Барселони»?", "2004")
question("Який клуб є найтитулованішим в Іспанії за кількістю чемпіонств?", "реал мадрид")
question("Скільки Кубків світу має збірна Аргентини?", "3")
question("Хто став чемпіоном Євро-2016?", "португалія")

print(f"Ваш результат: {score} із 10.")
