# print("Привітик! це збірка ігор")
print("Перша гра це гральні кості")
print("                                                                                                         ")
print("Вітаю! Це гральні кості,кидайте кубик та пишіть результати)")
print("Але є умови яких потрібно дотримуватися:Писати до 6 та не більше,тільки до 2 гварців.")
print("Приємної гри!")
Nomber_one = int(input("Яка сума чисел випала першому гравцеві?"))
Nomber_two = int(input("Яка сума чисел випала другому гравцеві?"))
res = Nomber_one > Nomber_two
res2 = Nomber_two > Nomber_one
if res == res2:
    print("Виграли обоє!")
else:
    print(f"Перший гравець виграв: {res}")
    print(f"Другий гравець виграв: {res2}")