from Sprite import*

# куля спадкується від спрайту
class Bullet(Sprite):

    # метод для руху кулі
    def move(self):
        # куля рухається вгору (y-) на свою швидкість
        self.rect.y -= self.speed

        # якщо куля доходить до верхньої межі (по y це 0)
        if self.rect.y < 0:
            # то куля прибирається з усіх груп і знищується
            self.kill()

    # метод-обгортка, оскільки клас "Група" може викликати лише методи, які називаються update
    def update(self):
        self.move()
        