import pandas as pd

data = {
    "Назва книги": [
        "1984",
        "Лісова пісня",
        "Кайдашева сім'я",
        "Гаррі Поттер і філософський камінь",
        "Володар перснів"
    ],
    "Автор": [
        "Джордж Оруелл",
        "Леся Українка",
        "Іван Нечуй-Левицький",
        "Дж. К. Роулінг",
        "Дж. Р. Р. Толкін"
    ],
    "Рік видання": [1949, 1911, 1879, 1997, 1954],
    "Жанр": ["Антиутопія", "Драма", "Реалізм", "Фентезі", "Фентезі"],
    "Країна автора": ["Велика Британія", "Україна", "Україна", "Велика Британія", "Велика Британія"]
}

# Створюємо DataFrame
df = pd.DataFrame(data)

# Додаємо нумерацію з 1 (замість стандартного індексу 0,1,2...)
df.index += 1

# Книги жанру фентезі
fantasy = df[df["Жанр"] == "Фентезі"]
print(fantasy)

# Книги, видані до 1990 року
before_1990 = df[df["Рік видання"] < 1990]
print(before_1990)

# Книги жанру фентезі, які були видані до 1990 року
fantasy_before_1990 = df[ (df["Жанр"] == "Фентезі") 
                        & (df["Рік видання"] < 1990) ]

## orwell = 

## ukraine_after_1950 = 

britain_fantasy_or_drama = df[(df["Країна автора"] == "Велика Британія")
                            & (df["Жанр"] == "Фентезі")
                            | (df["Жанр"] == "Драма") ]   
