import pandas as pd

df = pd.read_csv('GoogleApps.csv')

# Скільки всього програм з категорією 'BUSINESS'?


# Чому рівне співвідношення кількості додатків для підлітків ('Teen') і для дітей старше 10 ('Everyone 10+')?

# Чому дорівнює середній рейтинг платних програм? Відповідь запиши з точністю до сотих.


# На скільки середній рейтинг безкоштовних додатків менший за середній рейтинг платних?
# free_mean =
# paid_mean = 
# print(paid_mean - free_mean)

# Чому дорівнює мінімальний та максимальний розмір додатків у категорії 'COMICS'?
