import pandas as pd

data = {
    "Назва товару": [
        "Ноутбук Lenovo", "Смартфон Samsung", "Навушники Sony", "Мікрохвильовка LG",
        "Пилосос Samsung", "Навушники Xiaomi", "Телевізор LG", "Смартфон Xiaomi", "Смартфон Lenovo"
    ],
    "Категорія": [
        "Електроніка", "Електроніка", "Аксесуари", "Техніка для дому",
        "Техніка для дому", "Аксесуари", "Техніка для дому", "Електроніка", "Електроніка"
    ],
    "Виробник": [
        "Lenovo", "Samsung", "Sony", "LG",
        "Samsung", "Xiaomi", "LG", "Xiaomi", "Lenovo"
    ],
    "Ціна": [27000, 22000, 3500, 5000, 6200, 1500, 16000, 11000, 5999]
}

# Створення датафрейму на основі словника
df = pd.DataFrame(data)

# 1. Скільки товарів є в кожній категорії

# 2. Скільки товарів виготовляє кожен виробник


# 3. Середня ціна товарів у кожній категорії


# 4. Медіанна ціна серед товарів кожного виробника


# 5. Мінімальна та максимальна ціна товарів у кожній категорії


# 6. Мінімальна та максимальна ціна товарів для кожного виробника в межах кожної категорії


# 7. Зведена таблиця (кількість товарів)
