import pandas as pd


df = pd.read_csv('GoogleApps.csv')

### ЗАВДАННЯ №1

# Як називається програма, розташована першим у наборі даних?
print(df.head())


# До якої категорії відноситься додаток, розташований останнім у наборі даних?
print(df.tail())


# Скільки стовпців міститься у наборі даних?
# Дані якого типу зберігаються у кожному зі стовпців?
print(df.info())


# Вкажи середнє арифметичне та медіану розміру додатків (Size)
# Скільки коштує найдорожчий додаток?
# *Вкажи середнє арифметичне та медіану кількості установок додатків (Installs)
print(df.describe())


### ЗАВДАННЯ №2

# Скільки коштує (Price) найдешевший платний додаток (Type == 'Paid’)?
paid_min = df[df["Type"] == "Paid"]["Price"].min()
print(paid_min)

# Чому дорівнює медіана кількості установок програм із категорії ART_AND_DESIGN?
# За допомогою фільтрації виберіть з датасету програми, що належать до категорії (Category) ART_AND_DESIGN. Знайди медіану (median) кількості установок (Installs) серед усіх відібраних програм.
# Відповідь дай у вигляді цілого числа
installs_median = df[df["Category"] == "ART_AND_DESIGN"]["Installs"].median()
print(installs_median)


# Наскільки максимальна кількість відгуків (Reviews) для безкоштовних програм (Type == 'Free')
# більше максимальної кількості відгуків для платних програм (Type == 'Paid')?


# Який мінімальний розмір (Size) програми для тинейджерів (Content Rating == 'Teen')?

