import pandas as pd

books = [
    "1984",  
    "Лісова пісня",  
    "Кайдашева сім'я", 
    "Гаррі Поттер і філософський камінь", 
    "Володар перснів"  
]

authors = [
    "Джордж Оруелл", 
    "Леся Українка",
    "Іван Нечуй-Левицький",
    "Дж. К. Роулінг",
    "Дж. Р. Р. Толкін"
]


books_series = pd.Series(books)
books_series.index += 1
print(books_series)

books_series = pd.Series(books, index=authors)
print(books_series)


#----------------------------------
data = {
    "Назва книги": [
        "1984",
        "Лісова пісня",
        "Кайдашева сім'я",
        "Гаррі Поттер і філософський камінь",
        "Володар перснів"
    ],
    "Автор": [
        "Джордж Оруелл",
        "Леся Українка",
        "Іван Нечуй-Левицький",
        "Дж. К. Роулінг",
        "Дж. Р. Р. Толкін"
    ],
    "Рік видання": [1949, 1911, 1879, 1997, 1954],
    "Жанр": ["Антиутопія", "Драма", "Реалізм", "Фентезі", "Фентезі"]
    }

books_df = pd.DataFrame(data)
print(books_df)
