from Sprite import*
from constants import*

# спадкується від Спрайту
# копіює хітбокс та зображення
class Player(Sprite):

    # метод керування
    # параметрах отримуємо напрямки
    def controls(self, left, right, up, down):

        # отримуємо, які клавіші були натиснуті в даний момент
        key_pressed = pygame.key.get_pressed()

        # якщо натиснута клавіша вліво
        # і хітбокс гравця не зайшов за ліву межу
        # ліва межа це  х = 0
        # тут робимо невеличкий відступ в 5 пікселей
        if key_pressed[left] and self.hitbox.x > 5:
            # рухаємо вліво з певною швидкістю
            self.hitbox.x -= self.speed

        # якщо натиснута клавіша вправо
        # і хітбокс гравця не зайшов за праву межу
        # права межа це  х = ширині вікна
        # тут робимо невеличкий відступ в 5 пікселей
        if key_pressed[right] and self.hitbox.x < WINDOW_WIDTH - 5:
            # рухаємо вправо з певною швидкістю
            self.hitbox.x += self.speed

        # якщо натиснута клавіша вгору
        # і хітбокс гравця не зайшов за верхню межу
        # верхня межа це  у = 0
        # тут робимо невеличкий відступ в 5 пікселей
        if key_pressed[up] and self.hitbox.y > 5:
            # рухаємо вгору з певною швидкістю
            self.hitbox.y -= self.speed

        # якщо натиснута клавіша вниз
        # і хітбокс гравця не зайшов за нижню межу
        # нижня межа це  у = висота вікна
        # тут робимо невеличкий відступ в 5 пікселей
        if key_pressed[down] and self.hitbox.y < WINDOW_HEIGHT- 5:
            # рухаємо вниз з певною швидкістю
            self.hitbox.y += self.speed