# -*- coding: utf-8 -*-
""" Програма використовує flask та запускає веб-сервер.
При запиті на цей сервер він повертає текст "Привіт, Світ!" """
from flask import Flask

def index():
    """ Функція повертає текст документа """
    return 'Привіт, Світ!' 

# Створюємо об'єкт веб-програми:
app = Flask(__name__)   # параметр - ім'я модуля для веб-програми
                        # значення __name__ містить коректне ім'я модуля для поточного файлу
                        # у ньому буде значення "__main__", якщо модуль запускається безпосередньо
                        # та інше ім'я, якщо модуль підключається

app.add_url_rule('/', 'index', index)   # створює правило для URL:
                                        # при отриманні GET-запиту на адресу '/' на цьому сайті
                                        # запускатиметься функція index (вказана третім параметром)
                                        # та її значення буде відповіддю на запит.
                                        # Другий параметр - endpoint, "кінцева точка", -
                                        # це рядок, який містить ім'я цього правила.
                                        # Зазвичай endpoint рекомендують робити ідентичним ім'я функції,
                                        # але в складних додатках може бути кілька функцій з одним ім'ям у різних модулях, 
                                        # і для розрізнення їх у межах всього сайту можна вказувати різні endpoint.

if __name__ == "__main__":
    # Запускаємо веб-сервер:
    app.run() 
