scores = 0
print("ПРИВЕЦТВИЮ В МЕГА СУПЕР ПУПЕР ВИКТОРИНУ!!!!!!!!!!!!!")
print("ТОЛЬКО 00.1% СМОГЮТ УГАДАТЬ!")
print("ЕСЛИ ТИ ОТГОДАЕШЬ ТО ТИ ПОЛУЧАЕШЬ...")
print("...")
print("900000000000000000000000000000000000000000000$!")
def quention(q, right_answer):
    global scores
     
    ans = input(q)
    if ans.lower() == right_answer.lower():
        print("КАК ТИ УГАДАЛ!!!")
        scores += 3
    else:
        print("ХАХАХ НЕ ПРАВІЛЬНО!!")
       

def result():
    
    if scores > 17:
        print("ЧИТЕР!🤬")
    elif scores> 11:
        print("ну ладно😒")
    else:
        print("хпахпхахпхапхахп😛")

quention("кто самій бистрий?", "ЛЕОПАРД")
quention ("кто самий богатій?" , "бiл гейтс")
quention ("сінонім слову одинокий?" , "НЕ ОДИНОКИЙ")
quention ("а?" , "б")
quention ("кто такой тайлер дерден?" , "тайлер дердон єто знамінітий персонаж із книги бійцовскій клуб по цій книги сняли культовий фільм.читать еще")
quention ("самая большая вещь в міре?" , "ТВОЯ МАМКА!ХАХАХАХАХ.простіте😥")
quention ("😂?" , "😥")
result()

#кто самій бистрий? правільний>ти  когда сьел ХАЛОПЕНЬЕ!АХАХАХАХА
#кто самий богатіq? правильний>БАБУШКА!
#сінонім слову одинокий?>НЕ ОДИНОКИЙ
#а?>б
#кто такой тайлер дерден?>тайлер дердон єто знамінітий персонаж із книги "бійцовскій клуб" по цій книги сняли культовий фільм.читать еще
#самая большая вещь в міре?>ТВОЯ МАМКА!ХАХАХАХАХ.простіте:(
#если победіл=ЧИТЕР!
#если проіграв=ХАА ЛОШАРА