# бажаємо успіхів та трудолюбивості
scores = 0
def question(q, right_answer):
    global scores
    
    ans = input(q)
    if ans.lower() == right_answer.lower():
        print("Вірно!")
        scores += 1
    else:
        print("Не вірно!")

def result():
    if scores > 8:
        print("Відмінно")
    elif scores > 4:
        print("добре")
    else:
        print("погано")
    
    
question("яка планета Сонячної системи найбільша?", "Юпітер")
question("Який хімічний елемент має символ 'О'?", "Кисень")
question("Хто був першим президентом США?", "Джордж Вашингтон")
question("Яка найвища гора в світі?", "Еверест")
question("У якій країні знаходиться Статуя Свободи?", "США")
question("У якому році почалася друга світова війна?", "1939")
question("Столиця України?", "Київ")
question("Яка Найтвердіша природна речовина на Землі?", "Алмаз")
question("Скількі букв у грецькому алфавіті?", "24")
question("як називається число з 100 нулями?", "Гугол")
result()