# бажаємо успіхів та трудолюбивості
scores = 0

def question(q, right_answer):
    ans = input(q)
    global scores
    if ans.lower() == right_answer.lower():
        print("допустим правильно")
        scores +=1
    else:
        print (f"двієшник іди в школу вчися! Правильна відповідь: {right_answer}")
    
def result():
    if scores > 9:
        print("оооо кайф")
    elif scores > 5:
        print("ну норм")
    else:
        print("еее за самостійну два!!!!!!!")
        
        
question("Столиця України? ", "Київ")
question("коли почалася перша світова війна?", "28 липня 1914")
question("коли почалася друга світова війна?", "1 вересня 1939")
question("який зріст у арнольда шварценеггера?", "1.88 м")
question("якого кольору жовтий?", "собі подібного")
question("коли народився гітлер?", "20 квітня 1889")
question("коли закінчилась перша світова війна?", "11 листопада 1918")
question("Коли закінчилась друга світова війна?", "2 вересня 1945 року")
question("2+2=", "4")
question("210-2974", "-2764")
question("найбільш населена країна світу", "Індія")
question("5-5", "0")
result()
