
# Найдовша річка
# Найвишя гора
# Найглибше озеро
# Найвища гора яка знаходиться в Україні
# Де знаходиться амазонка
# Столиця України
# Найшвидша тварина в світі
# Столиця Японії
# Столиця Польши
# Де знаходиться ейфейова вежа
scores = 0
def question(q, right_answer):
    global scores
    ans = input("q")
    if ans == right_answer:
        print("відповідь вірна")
        scores += 1
    elif ans == "Харків":
        print("ви знашли посхалку")
        scores += 10
    else:
        print("відповідь невірна")
def result():
    if scores > 12:
        print("дуже добре")
    if scores > 7:
        print("чудово")
    elif scores > 4:
        print("добре")
    else:
        print("погано")
question("Найдовша річка? ","Амазонка")
question("Найвишя гора? ","Еверест")
question("найглибше озеро? ","Байкал")
question("найвища гора яка знаходиться в Україні  ","Говерла")
question("де знаходиться амазонка? ","В Бразилії")
question("Столиця України? ","Київ")
question("Найшвидша тварина в світі? ","Гепард")
question("Столиця Японії? ","Токіо")
question("Столиця Польши? ","Варшава")
question("Де знаходиться Ейфелова вежа? ","В Парижі")
result()
