from Sprite import*

# спадкується від класу спрайт
# копіює такі властивості: хітбокс, зображення
class Bullet(Sprite):

    # клас "Снаряд" доповнює спрайту рухом
    # direction_x - це напрямок снаряду, вліво чи направо
    def move(self, direction_x):
        # рухаємось в певному напрямку, помноживши на direction_x
        # direction_x може бути або -1 або 1
        # якщо -1, то напрямок змінюється
        # якщо 1, то напрямок на змінюється 
        self.hitbox.x += self.speed * direction_x